# Add or Remove Rows and Columns Add or Remove Rows and Columns

## Columns
### Adding

In [1]:
import pandas as pd

In [2]:
dicts1 = {'first': ['Corey', 'Jane', 'John'], 
         'last': ['Schafer', 'Doe', 'Doe'], 
         'email': ['coreyschafer@email.com', 'janedoe@email.com', 'johndoe@email.com']}

In [3]:
# dataframe creation
data = pd.DataFrame(dicts1)
data.head()

   first     last                   email
0  Corey  Schafer  coreyschafer@email.com
1   Jane      Doe       janedoe@email.com
2   John      Doe       johndoe@email.com

In [4]:
data['full_name'] = data['first'] + ' ' + data['last']
data

   first     last                   email      full_name
0  Corey  Schafer  coreyschafer@email.com  Corey Schafer
1   Jane      Doe       janedoe@email.com       Jane Doe
2   John      Doe       johndoe@email.com       John Doe

### Removing

In [7]:
data_new = data.drop(columns = ['first', 'last'])
data_new

                    email      full_name
0  coreyschafer@email.com  Corey Schafer
1       janedoe@email.com       Jane Doe
2       johndoe@email.com       John Doe

In [9]:
### To reverse it back
data_new['full_name'].str.split(' ') # gives list

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [11]:
data_new[['first', 'last']] = data_new['full_name'].str.split(' ',expand=True)

In [12]:
data_new

                    email      full_name  first     last
0  coreyschafer@email.com  Corey Schafer  Corey  Schafer
1       janedoe@email.com       Jane Doe   Jane      Doe
2       johndoe@email.com       John Doe   John      Doe

## Rows

### Adding Row

In [13]:
data

   first     last                   email      full_name
0  Corey  Schafer  coreyschafer@email.com  Corey Schafer
1   Jane      Doe       janedoe@email.com       Jane Doe
2   John      Doe       johndoe@email.com       John Doe

In [17]:
data = data.append({'first': 'Tony'}, ignore_index=True)

In [23]:
dtata = data.append(data_new, ignore_index=True, sort=False)
data

   first     last                   email      full_name
0  Corey  Schafer  coreyschafer@email.com  Corey Schafer
1   Jane      Doe       janedoe@email.com       Jane Doe
2   John      Doe       johndoe@email.com       John Doe
3   Tony      NaN                     NaN            NaN

In [21]:
data.append(data_new, ignore_index=True, sort=True)

                    email  first      full_name     last
0  coreyschafer@email.com  Corey  Corey Schafer  Schafer
1       janedoe@email.com   Jane       Jane Doe      Doe
2       johndoe@email.com   John       John Doe      Doe
3                     NaN   Tony            NaN      NaN
4  coreyschafer@email.com  Corey  Corey Schafer  Schafer
5       janedoe@email.com   Jane       Jane Doe      Doe
6       johndoe@email.com   John       John Doe      Doe

In [27]:
data = data.drop(index=3)
data

   first     last                   email      full_name
0  Corey  Schafer  coreyschafer@email.com  Corey Schafer
1   Jane      Doe       janedoe@email.com       Jane Doe
2   John      Doe       johndoe@email.com       John Doe

In [30]:
filt = (data['last'] == 'Doe')
data.drop(index=(data[filt]).index)

   first     last                   email      full_name
0  Corey  Schafer  coreyschafer@email.com  Corey Schafer